# Database Name : RSQL
# Table Name : score
id, korea, english, mathmatics

- Anaconda Navigator
- rJava, RMySQL 설치하기

In [9]:
library(RMySQL)

In [ ]:

conn <- dbConnect(MySQL(),
                dbname = 'RSQL',
                 user = 'root',
                 password = 'qwer1234',
                 host = '127.0.0.1'
                )

In [ ]:
# 테이블 목록
dbListTables(conn)

In [ ]:
# 테이블의 컬럼 목록
dbListFields(conn, 'score')

In [ ]:
# Select
dbGetQuery(conn, 'select count(*) from score')

In [ ]:
dbGetQuery(conn, 'select * from score')

In [ ]:
dbSendQuery(conn, 'insert into score values (1, 100, 100, 100)')

result = dbGetQuery(conn, 'select * from score')
result

In [ ]:
#insert
dbSendQuery(conn, 'insert into score values (2, 90, 90, 90)')

result = dbGetQuery(conn, 'select * from score')
result

In [ ]:
#update
dbSendQuery(conn, 'update score set korean=90, english=80, mathmatics = 70 where id=2')

result = dbGetQuery(conn, 'select * from score')
result

In [ ]:
#delete
dbSendQuery(conn, 'delete from score where id=2')

result = dbGetQuery(conn, 'select * from score')
result

In [ ]:
# csv file을 읽어서 MySQL에 넣기

In [36]:
data <- read.csv("../R_yang/score.csv", header = F)
colnames(data) <- c('id','korean','english','mathematics')
data

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [40]:
dbWriteTable(conn, "score", data, overwrite = T, row.names=F)

[1] TRUE

In [41]:
data2 <- read.csv("../R_yang/score2.csv", header = F)

In [42]:
dbWriteTable(conn, "score", data, overwrite = T, row.names=F)

[1] TRUE

In [44]:
result = dbGetQuery(conn, 'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [46]:
#Disconnect
dbDisconnect(conn)

[1] TRUE

In [ ]:
MySQL 설정에서 테이블에서 입력

#SHOW VARIABLES LIKE 'local_infile';   
#SET GLOBAL local_infile = 1;